{
    "messages": [
        {
            "page_content": "The\n07 17 88\nDATE\n88 010565\nE-192\nOfficer Serio\nRELATED FILES\nPAGE 1\nCOMPLAINT #\nWe were told by\nEXHIBIT\nWilliam Ambulance Service\nOne wearing a gray coloned\nFILE\nCROSS\ntabbles'\n8. 1 Larry Donnel Thompson,\nWilliam T. Quinton\nAuxilary Units were also called out\nThis officer did not get a chance to\nMany Townsend\nThe female doctor in the emergency room\nCobb\nBlockett C34\nWhite C3\nWeaver C32\nOfficer Keeton, the first to annive on the\nDEFENDANT\nVICTIM\nDouglas Brown,\n308. 7800\nAPPROVED (Name and title)\nSIGNATURE (Agent)\nPope\nKeeton C35\nPrescottSob Anderson SO7\nOFFICIAL USE ONLY\nSerio L5,\nMorley CI\nAuxilary Units\nOTHER OFFICERS\nSee List:\n(Continued)\nJohn Jackson,\nNeither it nor its contents may be disseminated outside the agency\n2. ) John Henry Dotstry, 3. ) Tynone Lewis, 4. ) John Henry. Norman,\nThis report is the property of the Investigative Division of the Cleveland.\nREQUESTED ACTION\nCOMPLETED\nINVESTIGATIVE DIVISION OF CLEVELAND POLIG\nTownsend also stated that they apparently left out the south doon.\n\" 6.1\nCLOSED\nIt is believed that the subject(A) took in the neighborhood of $185.00 in bills.\nSubject nobbed' with handgun, shot in abdomin and leq, Left side crea.\nMiany Townsend (Victim)\nShot in abdomin, leg.\n61 Quickie Hwy. 61\nI Keith Thompson,\n0\nFROM:\nACTIVE\ninformation in reference to a description of the subject(1) involved.\nLying on the floor behind the cash register, in a pool of blood.\nin keeping people away from the inside of the store.\nto assist in containing the area in care the subject on subjects were still in the area.\nStone located on Hwy 61 across from Rossman 1.\nthe assistance of Butch Prescott JO6 of the B. C. S. O. and Charles Andenson S7 who assisted\ntype cap, he was the one that pulled the trigger.\nscene, annival time, 22:29 Hrs. discovered a W/F, lated IDed to be the cashier, Many Townsend,\nwas called to the scene and immediately took the victim to the Bolivar County Hospital.\nSO17 Townsend that she told him that the subjects were young black/males; one light skinned\nAt approx. 22:28 Hrs. this police department received an alarm dealing with the 61 Quickie\nAcEre was protected until investigators annived. Officer Serio worked the crime scene with\none dank skinned, standing approx. 5'4\" to 5'6\", weight unknown.\nshirt the other one wearing a blue shint, the one in the gray shirt also had on a baseball\ntold this officer not to talk to the victim and that she was being rushed to sungery and at\nThis officer and Officen White then went to the emergency room to see if we could get any\nLE TITLE\ncapable of doing this.\nshooting\n1.) Micheal McLou,\ndid find a spent piece of Lead behind the counter, apparently a 38 nound, smashed flat,\nHER\nlying in an anea that would have put the subject behind the counter at the time of the\nThis officer and Officen White compiled several pictures of suspects, we feel would be\n1.7\nGION\ntalk with the victim before The entered surgery.\nthis time wouldn't be talking connectly, due to the medicine they were giving hen to prep\nher for surgery.\nEPORT OF INVESTIGATION\n5. ) Gary Dumas,\nJACTION REQUESTED\nPORT RE :\nSTRICT\nIt is unclean at this time as to what caused the subject to shoot the victim.\nY Quinton\nATE 07 17 88\nr Cleveland Police Dept.",
            "page_number": 1
        },
        {
            "page_content": "88-010565\nof value and\nCOMPLAINT #\nPAGE 2 OF\nAlso had pictures of extras\nGary Fonnest, Adrian Smith, and\nE-193\n.-\n-.\nDEFENDANT\nVICTIM\n07 17 88\nOFFICIAL USE ONLY\nDATE\nThis report Is the property of the Investigative Division of the Cleveland Police Department.\nINVESTIGATIVE DIVISION OF CLEVELAND POLICE DEPARTMENT\n-\netc.\njohn Skippen, Leroy Binge, Antonio Shelton, James Thompson, John Williams, George Matthews,\nREPORT OF INVESTIGATION\nThis report will be continued at a Later date. W.T. G. C7\nhigh rate of speed, the subjects that were in this can are:\npurchases.\nA Facque, Manager of Domino's Pizza stated that he www a Brown mall can Leave the area at a\nThis writer did a sketchy original report, because of this information being of v\nNeed pictures of Jimmy Bass, Marcus Thomas, and Micheal Matthews.\nManuel Smith,\nCarl Williams, this officer and Officer White are going to talk with there subjects in the\nmorning, but feel that they were not the ones in the robbery, but may have seen something.\nWe talked with these subjects this date, but will get detailed statements in the morning. Adria\nmother stated that she had sent them to the stone, but that they didn't come back with any\nthis officer not wanting, it in the paper for the defendants to see and be able to hide evidence\nContinued:\nFORM #2\n. .\nTLE TITLE",
            "page_number": 2
        },
        {
            "page_content": "the time of the\nCOMPLAINT # 88 010565\nPAGES OF\nE-194\nAnanasE in which InAnart\nShe stated that she didn't feel that\nVICTIM\nDEFENDANT\n1\nJuly 19, 1988\nOFFICIAL USE ONLY\nDATE\nAll of the above pictures were left in the Line-up and\n..\n-\nThis report is the property of the Investigative Division of the Cleveland Police Department.\nV.T.Q. C7\nINVESTIGATIVE DIVISION OF CLEVELAND POLICE DEPARTMENT\n61 Quickie firm. Rob\nMany Townsend (Victim)\nThomas\n11:00 AM, on Monday, July 18, 1988, this officer took several color pictures to the\nGany Dumas\nJohn Henry Doistry\nManuel Smith\nJohn Skippen\nAntonio Shelton\nFiancus\nTurone Lewis\nJohn Jackson\nJames Thompson\nWalter Green\nDouglas Brown\nJohn Herny, Honnan\n) Steve Ratliff\nREPORT OF INVESTIGATION\nFORM #2\n1. ) John Williams\nFILE TITLE\n0. 1\nShe Looked through a few pictures, coloned photos and stated that she didn't see the party on\n5.) Lenou Binge\n6. ) George Matthew\n3.1\n9.1\n1.1\nREFERENCE: Line-Up ( Picture Identification)\n2. )\n4 ) Michael Acou\n2. /\nAt approx.\nhe parties involved in the Robbany.\nhe felt was the one that shot her, she stated that she could betten identify the subject if\nIt she was pretty sure that he was the one by the photo.\nBolivar County Hospital, C. I.C. U. unit and asked Dn. Wright if I could speak with Many Townsend.\n8.1\n3. 7\nhe baseball cap on and had ordered the hotaog, that she was fixing during the time of the\nparties involved in the robbery in these pictures, see list of names in Line-up:\n4.1\nS. ) Jenny Henny\nhe victim, Many Townsend then picked out picture number 19, Mancus Thomas as being. the person,\nhe saw him in person, but that she was almost sure that this was the person that actually\nHe stated that I could. I went into the room, in the presence of Tinny Townsend, B. C. S. O. 17\n7.1\nhe following pictures of persons were caded to the Line-up:\nobbeny. She again stated she would feel better if she could pick him out of\nt approx. 2:00 PM this date, this officer anain went to the Bolivar County Hospital. and talked\nintinued on page 4\nwe would be able to pick the third person invovled in the robbery out, because she didn't pay\nith the victim, again asking her to look through some pictures to see if she could identifiy\n5. ) Kevin Nonthington\nhot her.\" She then picked out picture number 20, Lanny Thompson as being the subject that had\nhat much attention to him and that he stayed near the door, possibly as the look-out.\n7. )\n3. ) Lanny Donnell Thompson\nS. ) Anthony Keaton",
            "page_number": 3
        },
        {
            "page_content": "She described\n88 010565\n, 3. ) James\nWTQ\nCOMPLAINT #\nPAGE 4 OF\nchall cap and again placed\nof identification on each. She\nthe baseball\nE-195\n5. ) Marcus\nShe stated that she then pushed the button\nDEFENDANT\nVICTIM Many Townsend\nJuly 19, 1988\nShe stated that she made no sudden move to make him\n3)\nOFFICIAL USE ONLY\nDATE\nShe stated that she would recognize them in person and that\nShe stated that there were the two that she had picked out in\nDA'S HAS\nJuly 16, 1988, and the subject with the sun told her to back off.\n-\nThomas -\nThis will be annanned at a Later date, she also stated that Larry Thompson\nThis report is the property of the Investigative Division of the Cleveland Police Department.\n9. 1 Jimmy Bass, 10. ) Anthony Keaton\nThompson\nINVESTIGATIVE DIVISION OF CLEVELAND POLICE DEPARTMENT\nJohn Jackson, 5), Marcus Thomas, 6. ) Douglas Brown, 7) Lanny Thompson, 8. )\nGary Dumas\nLarry\nJohn Henny Dotatry\nKeith Thompson\nMicheal Mccoy\nJimmy Bass\nMarcus\n61 Quickie Ann Rob\n4.%\n10361\nriminiLibia\nREPORT OF INVESTIGATION\nhis hanning around with there other subjects:\nhe stood approx. 5'7\" to 5'8\"' and was also slender build.\nI then had hen look through some black and white photos do identify these parties again and\npossibly identify the other party, one we suspected as having been invovled also, because of\nhad been in and out of the stone for the week before and that they had been in the stone short\nthe shooter subject Attod approx. \"5'5\" slender and hed on a gray coloned shirt.\nI then advised her I would get back with her later when she felt better and would get a\n(.) 08544\ndetailed statement from her and would get a Live Line-up set up later for her.\nthe register, behind the counter and not the money himself, he then turned and shot her twice\nand told the other ones, let's get out of here.\nshoot her and didn't threaten to call the police on anything else. She stated that there subje\nbefore pulling the armed robbery.\"\nback of that picture, with myself placing the time and date of i\nher initials on this picture.\nconsisting of the following persons. 1 ) Micheal McCoy, 2. ) Marcus\nthen again picked out Lanny Thompson as being the person in the 6\nthe color photos, and was connect.\nthe ban, she was going to just get near the button, alann button, that had just been placed\nShe then stated that he told her to get the money, but before she had time to, he went to\nShe again picked the pictures of Mancus Thomas as the shooter, and wrote her initials on the\nI then asked her what caused the person to shoot her and she stated that when he came behind\nthe weapon as being gray, she thought at first it was a joke because the our didn't Look neal.\nWent to room 365. at the B.C. H. this date and showed Many Townsend' a VCR picture Line-up\nHaywood,\nThis Line-up was shown a t approx. 1:30 PM in the presence of Ollie White, Timmy Townsend\n3.1 10313\nand this officer, Quinton, she stated that she was almost positive that the subject in picture\n1 complexion appeared to dank, but the number two person Looked like him.\n6.) (0484\nin the stone on Saturday ,,\n2. 7 09500\n5. ) 10469\nsee him in person.\nFORM #2\n7.1 10725\nJuly 22, 1988\nFILE TITLE\nI She stated that the other one was wearing a blue shirt and had on a baseball type cap and that\n/ number 15 was the subject that shot her, but she would be absolutely positive is she could",
            "page_number": 4
        },
        {
            "page_content": "88 010565\n\" This line-up\n#9 Jimmy Bass,\n-\nCOMPLAINT #\nPAGE 5 OF\n. :\nThe Line-up was conducted at\nE-196\n#8 Nathan Tolden,\nciter having been advised of his\nfiankus Thomas\nManu Townsend\nThompson,\nDEFENDANT\nVICTIM\nfilmed are listed on page 4 of this report.\nAugust 2, 1988\nI then obtained a taped statement from her in Reference\nThe following persons were placed in the Line-up:\nOFFICIAL USE ONLY\nand he told me, ct\n#7 Lanny.\nDATE\n,\nShe told us who the party was in the presence of Raymond Wong.\nThomas\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\nThis report is the property of the Investigative Division of the Cleveland Police Department.\n15 Marcus\nINVESTIGATIVE DIVISION OF CLEVELAND POLICE DEPARTMENT\n61 Quickie Arn Rob.\nsee tuped statements of subjects. I feel that the victim can recognize and identify the\ndefendant and is positive to the Line-up as to who shot hen, this officer also feels it\nthey all stated that they didn't see Markus. Thomas the night of the enned robbery,\nThis officer then attempted to get a statement from Perkus Thomas in the presence of\nand that Finnu's family being there to verify it.\nI talked with several of the members of Jimmy Bass's family, including Jimmy Bass and\nwould be difficult to identify the other parties involved\nMiranda Warnings, signing a waiver to this affect and then advised me that he had been\nin the holding cell door. All were Lined up with the numbers placed at their chest anec,\noun on ken and shot hen after having obtained the money $185.00 from her at the 61 quickie\nwe would contact hen later.\nhen with a gun was in the line-up and she stated that she was absolutely positive at this\nto the line-up and had hen clarify that no name has been mentioned to ken, her not knowing\nhe stated that he had to leave.\n10:45M this date Tuesday, August 2, 1988, stated that he couldn't wait any Longer for us\nin the holding cell door.\nStore on July 17, 1988, Sunday night.\nwith Jimmy Bass during the time of the robbery at his residence, Jimmy Bars's residence\nin the hallway aner and Lining the subjects up against the wall opposite the one way class\nThis officer along with Officers White, and Serio then asked her if the person that robbed\ntime having seen then in person that Markus thomas, #5\nno rucations were asked of any of them, they were told to look at the door, turn to their\nIT'Ss name until the end of the taped statement. She was then advised she could go home and\nleft, turn and face the rear, turn to the left again, and then face the doon crain. This\nAt this time, he stated is that the end of the Line-up,\" I informed him that it was and then\nher was in fact placed in the line-up.\nWe couldn't find some of the persons that were filmed on this date for the Line-up this\nmorning and Raymond Wong, who stood in to witness this Line-up this date at approx.\nto net the remaining persons involved in the VCR Line-up because he had to go to a\nPreliminary hearing at Justice Count at 11:00 Am this date.\nthe Cleveland Police department, placing the victim, flany Townsend inside a holding cell\nLine-up for the victim of the 071788 anned robbery to see if the party that actually shot\n#4 John Jackson, \"\"\n1988 at approx. 4:30 Wii, in the presence of defense attorney, Boyd Atkinson.\nwas filmed at this time and the pensons filmed are listed on page 4 of this\ntook approx. 4 Minutes and then they were all dispensed away from the ance, some having.\nOn this date, this officer and officers Senio and White compiled 6 pensons fon a physical.\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\nbeen taken back to fail and some released and taken home.\nContinued from Page (4 ) dated 07 19 88 WTQ.\n#11 Derrick Thomas.\nA VCR Line-up was gathered at the Bolivar County Sheriff's Office on Thursday, July 21,\nREPORT OF INVESTIGATION\nLE TITLE\nORM # 2\n) 10:45AM this date,",
            "page_number": 5
        }
    ]
}